99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt_agreement.c
        state->handle = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*state->handle), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (state->handle == NULL) { esp32_mquickjs_memory_payload_free(state); JS_ThrowOutOfMemory(ctx); return false; }
    }
    *output = state; return true;
}
static bool agreement_open_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output) { return agreement_capture(ctx, self, argc, argv, output, false); }
static bool agreement_broadcast_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output) { return agreement_capture(ctx, self, argc, argv, output, 4); }
static bool agreement_close_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output) { return agreement_capture(ctx, self, argc, argv, output, true); }
static bool agreement_suspend_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output) { return agreement_capture(ctx, self, argc, argv, output, 2); }
static bool agreement_resume_capture(JSContext *ctx, JSGCRef *self, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output) { return agreement_capture(ctx, self, argc, argv, output, 3); }
static void agreement_submit_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    if (!atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) {
        if (state->resume) state->error = esp32_mquickjs_wifi_radio_twt_individual_resume(&state->token, &state->information_identity);
        else if (state->suspend) state->error = esp32_mquickjs_wifi_radio_twt_individual_suspend(
            &state->token, state->duration_ms, &state->information_identity);
        else if (state->broadcast) state->error = esp32_mquickjs_wifi_radio_twt_broadcast_submit(&state->broadcast_options, &state->token);
        else state->error = esp32_mquickjs_wifi_radio_twt_individual_submit(&state->options, &state->token);
    }
    atomic_store_explicit(&state->worker_done, true, memory_order_release);
}
static void agreement_schedule(esp32_mquickjs_future_driver_state_t *state)
{
    if (state->submitted || atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) return;
    if (state->close) {
        (void)agreement_request_close(state->broadcast, &state->token);
        state->submitted = true;
        atomic_store_explicit(&state->worker_done, true, memory_order_release);
    } else state->submitted = esp32_mquickjs_submit_background_worker(agreement_submit_worker, state);
}
static bool agreement_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx; (void)runtime; (void)token; agreement_schedule(state); return true;
}
static esp32_mquickjs_future_poll_t agreement_poll(esp32_mquickjs_future_driver_state_t *state)
{
    agreement_schedule(state);
    (void)esp32_mquickjs_wifi_twt_agreement_service();
    if (state->submitted && !atomic_load_explicit(&state->worker_done, memory_order_acquire)) return ESP32_MQUICKJS_FUTURE_PENDING;
    if (atomic_load_explicit(&state->cancel_requested, memory_order_acquire)) return ESP32_MQUICKJS_FUTURE_READY;
    if (!state->submitted) return ESP32_MQUICKJS_FUTURE_PENDING;
    if (state->suspend) {
        bool present = esp32_mquickjs_wifi_twt_information_read(state->information_identity, &state->information);
        if (state->error != ESP_OK) return ESP32_MQUICKJS_FUTURE_READY;
        if (!present || state->information.abandoned) {
            state->error = ESP_ERR_INVALID_STATE; return ESP32_MQUICKJS_FUTURE_READY;
        }
        if (state->information.submitting || !state->information.complete) return ESP32_MQUICKJS_FUTURE_PENDING;
        state->error = state->information.submit_error ? state->information.submit_error : state->information.native_error;
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->broadcast) {
        bool present = esp32_mquickjs_wifi_radio_twt_broadcast_status(&state->token, &state->broadcast_result);
        if (state->error != ESP_OK) return ESP32_MQUICKJS_FUTURE_READY;
        if (!present) {
            if (agreement_present(&state->token, true)) return ESP32_MQUICKJS_FUTURE_PENDING;
            if (!state->close) state->error = ESP_ERR_INVALID_STATE;
            return ESP32_MQUICKJS_FUTURE_READY;
        }
        if (state->close) {
            esp_err_t cleanup = state->broadcast_result.cleanup_error;
            if (cleanup != ESP_OK && cleanup != ESP_ERR_NOT_FINISHED) {
                state->error = cleanup; return ESP32_MQUICKJS_FUTURE_READY;
            }
            return ESP32_MQUICKJS_FUTURE_PENDING;
        }
        const esp32_mquickjs_wifi_btwt_timer_result_t *native = &state->broadcast_result.native;
        if (state->broadcast_result.closing || native->ambiguous || native->native_closed) {
            state->error = ESP_ERR_INVALID_STATE; return ESP32_MQUICKJS_FUTURE_READY;
        }
        if (!native->complete || native->tx_busy || native->publishing) return ESP32_MQUICKJS_FUTURE_PENDING;
        if (!broadcast_setup_accepted(&state->broadcast_result))
            state->error = native->native_error ? native->native_error : native->submit_error ? native->submit_error : ESP_ERR_INVALID_STATE;
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->error != ESP_OK) {
        if (state->token.identity != 0U)
            (void)esp32_mquickjs_wifi_radio_twt_individual_status(&state->token, &state->result);
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (!esp32_mquickjs_wifi_radio_twt_individual_status(&state->token, &state->result)) {
        if (agreement_present(&state->token, false)) return ESP32_MQUICKJS_FUTURE_PENDING;
        if (!state->close) state->error = ESP_ERR_INVALID_STATE;
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->close) {
        if (state->result.cleanup_error != ESP_OK && state->result.cleanup_error != ESP_ERR_NOT_FINISHED) {
            state->error = state->result.cleanup_error; return ESP32_MQUICKJS_FUTURE_READY;
        }
        return ESP32_MQUICKJS_FUTURE_PENDING;
    }
    if (state->result.closing || (state->result.native.flags &
        (ESP32_MQUICKJS_WIFI_TWT_SETUP_AMBIGUOUS | ESP32_MQUICKJS_WIFI_TWT_SETUP_NATIVE_CLOSED))) {
        state->error = ESP_ERR_INVALID_STATE; return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (!(state->result.native.flags & ESP32_MQUICKJS_WIFI_TWT_SETUP_SEEN)) return ESP32_MQUICKJS_FUTURE_PENDING;
    const wifi_event_sta_itwt_setup_t *event = &state->result.native.event;
    if (event->status != 1 || event->config.setup_cmd != TWT_ACCEPT || event->config.reserved ||
        !event->config.min_wake_dura || !event->config.wake_invl_mant) state->error = ESP_ERR_INVALID_STATE;
    return ESP32_MQUICKJS_FUTURE_READY;
}
static JSValue agreement_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->error != ESP_OK) return agreement_error(ctx, state, false);
    if (state->close || state->suspend) return JS_UNDEFINED;
    JSValue object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_TWT_AGREEMENT);
    if (JS_IsException(object)) return object;
    state->handle->token = state->token; state->handle->broadcast = state->broadcast;
    if (state->broadcast) state->handle->broadcast_cached = state->broadcast_result;
    else state->handle->cached = state->result;
    JS_SetOpaque(ctx, object, state->handle);
    state->handle = NULL; state->transferred = true;
    return object;
}
static esp32_mquickjs_cancel_result_t agreement_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    atomic_store_explicit(&state->cancel_requested, true, memory_order_release);
    return ESP32_MQUICKJS_CANCEL_REQUESTED;
}
static void agreement_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    if (state->suspend) esp32_mquickjs_wifi_twt_information_abandon(state->information_identity);
    else if (!state->close && !state->transferred && state->token.identity != 0U)
        (void)agreement_request_close(state->broadcast, &state->token);
    esp32_mquickjs_memory_payload_free(state->handle); esp32_mquickjs_memory_payload_free(state);
    (void)esp32_mquickjs_wifi_twt_agreement_service();
}
static uint32_t agreement_timeout(const esp32_mquickjs_future_driver_state_t *state) { return state->broadcast ? state->broadcast_options.timeout_ms : state->options.timeout_ms; }
static JSValue agreement_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t ms)
{
    (void)ms; atomic_store_explicit(&state->cancel_requested, true, memory_order_release);
    return agreement_error(ctx, state, true);
}
static esp32_mquickjs_resource_key_t agreement_resource(const esp32_mquickjs_future_driver_state_t *state)
{ return state->close ? NULL : state->suspend ? &s_agreement_information_lane : &s_agreement_setup_lane; }
#define AGREEMENT_DRIVER(capture_fn) { .memory_owner = "wireless.future", .capture = capture_fn, .start = agreement_start, .poll = agreement_poll, \
    .finish = agreement_finish, .cancel = agreement_cancel, .destroy = agreement_destroy, \
    .timeout_ms = agreement_timeout, .on_timeout = agreement_on_timeout, .resource_key = agreement_resource }
static const esp32_mquickjs_future_driver_t s_agreement_open_driver = AGREEMENT_DRIVER(agreement_open_capture);
static const esp32_mquickjs_future_driver_t s_agreement_broadcast_driver = AGREEMENT_DRIVER(agreement_broadcast_capture);
static const esp32_mquickjs_future_driver_t s_agreement_close_driver = AGREEMENT_DRIVER(agreement_close_capture);
static const esp32_mquickjs_future_driver_t s_agreement_suspend_driver = AGREEMENT_DRIVER(agreement_suspend_capture);
static const esp32_mquickjs_future_driver_t s_agreement_resume_driver = AGREEMENT_DRIVER(agreement_resume_capture);
static JSValue agreement_call(JSContext *ctx, JSValue *self, int argc, JSValue *argv, const char *name)
{
    JSGCRef receiver_ref, ref;
    JSValue *receiver = JS_PushGCRef(ctx, &receiver_ref), *method = JS_PushGCRef(ctx, &ref);
    *receiver = *self;
    *method = JS_GetPropertyStr(ctx, *receiver, name);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *receiver, argc, argv);
    JS_PopGCRef(ctx, &ref); JS_PopGCRef(ctx, &receiver_ref); return result;
}
static JSValue agreement_setup_call(JSContext *ctx, JSValue *self, int argc, JSValue *argv, const char *name)
{
    (void)self;
    JSGCRef global_ref, wifi_ref, module_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "twt");
    JSValue result = JS_IsException(*module) ? JS_EXCEPTION : agreement_call(ctx, module, argc, argv, name);
    JS_PopGCRef(ctx, &module_ref); JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref); return result;
}
JSValue js_wifi_twt_setup_individual(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return agreement_setup_call(ctx, self, argc, argv, "setupIndividual"); }
JSValue js_wifi_twt_setup_broadcast(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return agreement_setup_call(ctx, self, argc, argv, "setupBroadcast"); }
JSValue js_wifi_twt_agreement_close(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return agreement_call(ctx, self, argc, argv, "close"); }
JSValue js_wifi_twt_agreement_suspend(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return agreement_call(ctx, self, argc, argv, "suspend"); }
JSValue js_wifi_twt_agreement_resume(JSContext *ctx, JSValue *self, int argc, JSValue *argv)
{ return agreement_call(ctx, self, argc, argv, "resume"); }
bool esp32_mquickjs_init_wifi_twt_agreement_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, object_ref, child_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *child = JS_PushGCRef(ctx, &child_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *global = JS_GetGlobalObject(ctx);
    if (JS_IsException(*global)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "wifi");
    if (JS_IsException(*object)) goto done;
    *child = JS_GetPropertyStr(ctx, *object, "twt");
    if (JS_IsException(*child)) goto done;
    if (!esp32_mquickjs_init_wifi_twt_close_runtime(ctx, runtime, child)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "setupIndividual");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_agreement_open_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "setupBroadcast");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_agreement_broadcast_driver)) goto done;
    *object = JS_GetPropertyStr(ctx, *global, "WiFiTwtAgreement");
    if (JS_IsException(*object)) goto done;
    *child = JS_GetPropertyStr(ctx, *object, "prototype");
    if (JS_IsException(*child)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "close");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_agreement_close_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "suspend");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_agreement_suspend_driver)) goto done;
    *method = JS_GetPropertyStr(ctx, *child, "resume");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_agreement_resume_driver)) goto done;
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register TWT agreement runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &child_ref); JS_PopGCRef(ctx, &object_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
